import { View, Image, StyleSheet, Text, Linking, TouchableOpacity, ScrollView } from 'react-native';
import Collapsible from './b.js';
import React, {Component} from 'react'

const Profile =()=>{

  const handlePress = () => {
    Linking.openURL('https://www.facebook.com/muhammad.zidane.988371/posts/1107741890274734');
  };

  const handlePress2 = () => {
    Linking.openURL('https://krishijagran.com/agripedia/a-guide-how-to-have-healthy-rose-plantation');
  };

  const handlePress3 = () => {
    Linking.openURL('https://www.youtube.com/watch?v=bLVl1PPv-J8');
  };

  return (
    <ScrollView contentContainerStyle={styles.scrollContainer}>
      <View style={styles.container}>
        <Text style={styles.text}>
          গোলাপ গাছের রোগ নিরাময় এবং রোপণ
        </Text>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/b.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Black Spot কালো দাগ</Text>
        
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}>
            ব্ল্যাক স্পট হল গোলাপ মালীদের জন্য একটি সাধারণ এবং বিরক্তিকর ছত্রাকজনিত রোগ। এখানে আপনার গোলাপে ব্ল্যাক স্পট প্রতিরোধ এবং মোকাবেলা করার জন্য একটি বিস্তারিত তালিকা দেওয়া হলো:
            {'\n\n'}
            <Text style={styles.sectionTitle}>পরিচিতি:</Text>
            {'\n'}
            {'\u2022'} ব্ল্যাক স্পট পাতা গুলিতে অস্বাভাবিক কালো দাগ হিসাবে প্রকাশ পায়, প্রায়ই হলুদ রিং দ্বারা ঘিরে থাকে।
            {'\n'}
            {'\u2022'} এই রোগ সাধারণত ঠাণ্ডা, আর্দ্র বসন্ত এবং পতনের মাসগুলোতে বেশি দেখা যায়।
            {'\n\n'}
            <Text style={styles.sectionTitle}>প্রতিরোধ:</Text>
            {'\n'}
            গাছ নির্বাচন: ব্ল্যাক স্পট প্রতিরোধের জন্য পরিচিত গোলাপের প্রজাতি বেছে নিন।
            {'\n'}
            জল দেওয়ার অভ্যাস: গভীরভাবে এবং কম পরিমাণে জল দিন, যাতে জল মূল পর্যন্ত পৌঁছে এবং পাতা ভেজানোর থেকে বিরত থাকে। ভেজা পাতা ছত্রাকের বৃদ্ধি বাড়ায়।
            {'\n'}
            বাতাস চলাচল: গোলাপের গাছের চারপাশে বাতাস চলাচল উন্নত করার জন্য কাটা করুন। এটি পাতা দ্রুত শুকাতে সাহায্য করে, ছত্রাকের সংক্রমণের ঝুঁকি কমায়।
            {'\n'}
            স্বাস্থ্যবিধি: গাছের গোড়ায় পড়া পাতা এবং আবর্জনা সরান। ছত্রাকের স্পোর এই উপকরণগুলিতে শীতকালে বেঁচে থাকতে পারে।
            {'\n'}
            ছত্রাকনাশক: একটি ছত্রাকনাশক ব্যবহার করুন যা ক্লোরোথালোনিল, ম্যানকোজেব, অথবা সালফার ধারণ করে, বিশেষ করে বসন্ত এবং পতনের সাধারণ প্রাদুর্ভাবের আগে।
            {'\n\n'}
            <Text style={styles.sectionTitle}>চিকিৎসা:</Text>
            {'\n'}
            প্রাথমিক শনাক্তকরণ: ব্ল্যাক স্পট দেখা দিলে, দ্রুত ব্যবস্থা নিন যাতে ছড়িয়ে পড়া প্রতিরোধ করা যায়।
            {'\n'}
            অপসারণ: সংক্রমিত পাতা সরিয়ে ফেলুন এবং ধ্বংস করুন যাতে ছত্রাকের স্পোর দূর করা যায়।
            {'\n'}
            ছত্রাকনাশক: গোলাপের ব্ল্যাক স্পট চিকিৎসার জন্য বিশেষভাবে লেবেল করা একটি ছত্রাকনাশক ব্যবহার করুন। প্রয়োগ নির্দেশনা অনুসরণ করুন। মনে রাখবেন, ছত্রাকনাশক প্রাথমিকভাবে ব্যবহৃত হলে সবচেয়ে কার্যকরী, তবে এটি রোগের বিস্তার ধীর করতে সাহায্য করতে পারে।
            {'\n\n'}
            <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
            {'\n'}
            মাথার উপর জল দেওয়া এড়িয়ে চলুন, যা স্বাস্থ্যবান পাতায় স্পোর ছিটিয়ে দিতে পারে।
            {'\n'}
            গোলাপ গাছের গোড়ায় মালচের একটি স্তর প্রয়োগ করার কথা বিবেচনা করুন, যা আগাছার বৃদ্ধি রোধ করে এবং মাটির ছত্রাকের স্পোরের আঘাত থেকে রক্ষা করতে সাহায্য করে।
            {'\n'}
            ব্ল্যাক স্পটের জন্য কিছু ঘরোয়া প্রতিকার যেমন বেকিং সোডার স্প্রে বা দুধের মিশ্রণ রয়েছে। তবে, এগুলি বাণিজ্যিক ছত্রাকনাশকের মতো কার্যকর নাও হতে পারে।
            {'\n'}
            এই টিপসগুলি অনুসরণ করে, আপনি আপনার গোলাপের ব্ল্যাক স্পটের ঝুঁকি উল্লেখযোগ্যভাবে কমাতে পারবেন এবং আপনার গোলাপ গাছগুলোকে স্বাস্থ্যবান এবং সমৃদ্ধ রাখতে পারবেন। মনে রাখবেন, প্রতিরোধই এই রোগের জন্য সেরা চিকিৎসা!
          </Text>
        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/p.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Powdery Mildew পাউডারের ন্যায় দাগ</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text>{'\n'}
          পাউডারি মিলডিউ, একটি ছত্রাকজনিত রোগ যা অনেক গোলাপকে আক্রান্ত করে, দেখতে খারাপ হতে পারে এবং আপনার সুন্দর গোলাপ গাছের বৃদ্ধি বাধাগ্রস্ত করতে পারে। এখানে আপনার গোলাপে পাউডারি মিলডিউ প্রতিরোধ এবং নিয়ন্ত্রণের জন্য একটি বিস্তারিত গাইড দেওয়া হলো:
          {'\n\n'}
          <Text style={styles.sectionTitle}>সনাক্তকরণ:</Text>
          {'\n'}
          পাতায়, ডালপালা, কুঁড়ি এবং এমনকি ফুলেও সাদা বা ধূসর বর্ণের পাউডারি দাগ দেখুন।
          {'\n'}
          এই ছত্রাকজনিত রোগ ঠাণ্ডা, আর্দ্র অবস্থায় এবং খারাপ বাতাস চলাচলে বৃদ্ধি পায়।
          {'\n\n'}
          <Text style={styles.sectionTitle}>প্রতিরোধ:</Text>
          {'\n'}
          অনুকূল পরিবেশ: আপনার গোলাপগুলির জন্য প্রতিদিন অন্তত ৬ ঘণ্টা রোদ দিন। পাউডারি মিলডিউ গরম এবং শুষ্ক পরিবেশে কম প্রভাবিত হয়।
          {'\n'}
          রোপণ: এমন একটি স্থান নির্বাচন করুন যেখানে ভালো বাতাস চলাচল হয় যাতে গোলাপ গাছের চারপাশে আর্দ্রতা সঞ্চিত না হয়। আপনার গোলাপগুলি পর্যাপ্ত দূরত্বে রোপণ করুন যাতে বাতাস চলাচল সহজ হয়।
          {'\n'}
          জল দেওয়া: গভীরভাবে এবং কম পরিমাণে জল দিন, জলকে গাছের গোড়ায় পৌঁছানোর চেষ্টা করুন এবং পাতাগুলিতে জল দেওয়া এড়িয়ে চলুন। ভিজে থাকা পাতাগুলি ছত্রাক বৃদ্ধির জন্য অনুকূল পরিবেশ সৃষ্টি করে।
          {'\n'}
          প্রতিরোধী জাত: পাউডারি মিলডিউ প্রতিরোধী গোলাপ জাত নির্বাচন করুন।
          {'\n'}
          সাংস্কৃতিক অভ্যাস: গোলাপ গাছের গোড়ায় পড়ে যাওয়া পাতা এবং আবর্জনা নিয়মিতভাবে সরান যাতে ছত্রাক শীতকালীন অবস্থায় থাকতে না পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>চিকিৎসা:</Text>
          {'\n'}
          প্রাথমিক শনাক্তকরণ: প্রাথমিক হস্তক্ষেপ অত্যন্ত গুরুত্বপূর্ণ। আপনি যদি পাউডারি মিলডিউ-এর লক্ষণ দেখতে পান তবে সংক্রমিত গোলাপ গাছটিকে পৃথক করুন যাতে রোগটি ছড়িয়ে না পড়ে।
          {'\n'}
          অপসারণ: প্রবলভাবে সংক্রমিত পাতা, ডালপালা, এবং ফুলগুলি কেটে ফেলুন এবং ধ্বংস করুন যাতে ছত্রাক স্পোরগুলি ছড়িয়ে না পড়ে।
          {'\n'}
          জৈব বিকল্প: মৃদু ক্ষেত্রে, আক্রান্ত এলাকাগুলিতে শক্ত জলরাশি স্প্রে করার চেষ্টা করতে পারেন স্পোরগুলি সরানোর জন্য। আপনি জৈব ছত্রাকনাশক যেমন নীম তেল সমাধান বা পটাশিয়াম বিকরবোনেট সমাধানও চেষ্টা করতে পারেন।
          {'\n'}
          ছত্রাকনাশক: পাউডারি মিলডিউ চিকিৎসার জন্য বিশেষভাবে লেবেলযুক্ত একটি ছত্রাকনাশক প্রয়োগ করুন, বিশেষত যদি জৈব পদ্ধতিগুলি কার্যকর না হয়। প্রয়োগ নির্দেশাবলী সাবধানে অনুসরণ করুন।
          {'\n\n'}
          <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
          {'\n'}
          আপনার গোলাপগুলিকে অতিরিক্ত সার প্রয়োগ করা এড়ান, বিশেষ করে নাইট্রোজেন সমৃদ্ধ সার ব্যবহার করে, কারণ এটি নতুন বৃদ্ধিকে উত্সাহিত করতে পারে যা পাউডারি মিলডিউ-এর প্রতি সংবেদনশীল।
          {'\n'}
          আপনার গোলাপগুলি নিয়মিতভাবে কেটে বাতাস চলাচল উন্নত করুন এবং ছত্রাকের আশ্রয়স্থলগুলি অপসারণ করুন।
          {'\n'}
          এই অভ্যাসগুলি অনুসরণ করে, আপনি পাউডারি মিলডিউ-এর প্রাদুর্ভাবের ঝুঁকি উল্লেখযোগ্যভাবে কমাতে পারবেন এবং আপনার গোলাপগুলোকে স্বাস্থ্যবান এবং সুন্দর রাখতে পারবেন। মনে রাখবেন, সঠিক যত্ন এবং মনোযোগের মাধ্যমে প্রতিরোধই এই রোগের বিরুদ্ধে সেরা প্রতিরক্ষা।
        </Text>
        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/s.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Rose Slug পোকার পাতা খাওয়া</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}>
          "সফ্লাই স্লাগ" শব্দটি সম্ভবত সফ্লাইয়ের লার্ভাকে বোঝায় যা গোলাপের পাতা খায়, যাকে সাধারণভাবে রোজ স্লাগস বা রোজ স্লাগওয়ার্ম বলা হয়। এগুলি প্রকৃত স্লাগ নয়, যদিও তাদের চেহারা শ্লামি মনে হতে পারে। এখানে রোজ সফ্লাই সম্পর্কে যা জানা দরকার:
          {'\n\n'}
          <Text style={styles.sectionTitle}>সনাক্তকরণ:</Text>
          {'\n'}
          ছোট, সবুজ, স্লাগের মতো সৃষ্টিগুলি খুঁজুন যাদের একটি নরম, লম্বা শরীর এবং একটি কালো মাথা থাকে (প্রজাতি অনুসারে)। এগুলি সাধারণত পাতার নিচের দিকে পাওয়া যায়।
          {'\n'}
          পাতার উপরের পৃষ্ঠে ক্ষতি দেখতে পাবেন, যেখানে সফ্লাইয়ের লার্ভা রক্তনালীগুলির মধ্যে নরম টিস্যু খেয়ে ফেলেছে এবং কঙ্কালময় দাগ তৈরি করেছে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>ক্ষতি:</Text>
          {'\n'}
          যদিও তারা সাধারণত গোলাপ গাছ মেরে ফেলে না, সফ্লাইয়ের ভারী আক্রমণ গুরুত্বপূর্ণ পাতার পতন ঘটাতে পারে, যা গাছের শক্তি এবং ফুলের উৎপাদন কমিয়ে দেয়।
          {'\n\n'}
          <Text style={styles.sectionTitle}>প্রতিরোধ:</Text>
          {'\n'}
          পরিদর্শন: আপনার গোলাপ গাছগুলি নিয়মিতভাবে পরিদর্শন করুন, বিশেষ করে পাতার নিচের দিক, সফ্লাইয়ের লার্ভার লক্ষণ খুঁজে বের করার জন্য।
          {'\n'}
          উপকারী কীটপতঙ্গ আকর্ষণ করুন: আপনার বাগানে লেডিবাগ, লেসওয়িংস এবং প্যারাসিটিক ওয়াস্প আকর্ষণ করুন, যেহেতু তারা সফ্লাইয়ের প্রাকৃতিক শিকারী। এই উপকারী কীটপতঙ্গ সফ্লাইয়ের জনসংখ্যা নিয়ন্ত্রণে সহায়ক হতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>নিয়ন্ত্রণ পদ্ধতি:</Text>
          {'\n'}
          ম্যানুয়াল অপসারণ: যদি আক্রমণ মৃদু হয়, তবে আপনি সফ্লাইয়ের লার্ভাগুলি হাতে তুলে নিয়ে সাবানযুক্ত পানিতে ফেলতে পারেন। যদি আপনি চান, গ্লাভস পরতে পারেন।
          {'\n'}
          শক্তিশালী জল স্প্রে: গার্ডেন হোস থেকে একটি শক্ত জলরাশি লার্ভাগুলিকে পাতার থেকে ফেলে দিতে পারে। তারা ফিরে উঠতে সক্ষম হবে না এবং পাখি বা অন্যান্য শিকারীদের শিকার হতে পারে।
          {'\n'}
          কীটনাশক সাবান বা নীম তেল: মধ্যম আক্রমণের জন্য, কীটনাশক সাবান স্প্রে বা নীম তেল সমাধান সফ্লাইয়ের লার্ভার বিরুদ্ধে কার্যকর হতে পারে। পণ্যের লেবেলের নির্দেশনা অনুসারে প্রয়োগ করুন, পাতার নিচের দিকে সম্পূর্ণ কভারেজ নিশ্চিত করুন।
          {'\n'}
          কীটনাশক (শেষ অবলম্বন): যদি আক্রমণ তীব্র হয় এবং অন্যান্য পদ্ধতি ব্যর্থ হয়, তবে স্পিনোসেড বা বিটি (ব্যাসিলাস থুরিঙ্গেনসিস) সমন্বিত একটি কীটনাশক স্প্রে ব্যবহার করার কথা ভাবুন। তবে, এই কীটনাশকগুলি উপকারী কীটপতঙ্গকেও ক্ষতিগ্রস্ত করতে পারে, তাই কেবল শেষ অবলম্বন হিসাবে ব্যবহার করুন।
          {'\n\n'}
          <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
          {'\n'}
          সঠিক জল দেওয়া, সার প্রয়োগ এবং কাটা-ছাঁটা অভ্যাসের মাধ্যমে আপনার গোলাপ গাছগুলিকে স্বাস্থ্যবান রাখুন। সুস্থ গাছগুলি কীটপতঙ্গ সমস্যার বিরুদ্ধে আরও প্রতিরোধী।
          {'\n'}
          পতন বা শীতকালে গোলাপ গাছের গোড়ায় পড়ে যাওয়া পাতা এবং আবর্জনা অপসারণ করুন। এটি সফ্লাইয়ের শীতকালীন জনসংখ্যা কমাতে সহায়ক হতে পারে।
          {'\n'}
          এই টিপসগুলি অনুসরণ করে, আপনি আপনার গোলাপে সফ্লাইয়ের আক্রমণ পরিচালনা করতে পারেন এবং আপনার গোলাপ গাছগুলি স্বাস্থ্যবান ও ভালোভাবে বৃদ্ধি পেতে সাহায্য করতে পারেন।
        </Text>

        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/bb.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Rose Botrytis Blight শুকনো গোলাপ</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}>
          বট্রাইটিস ব্লাইট, যা ধূসর ছত্রাক হিসেবে পরিচিত, একটি ছত্রাকজনিত রোগ যা বিশেষ করে ঠাণ্ডা, ভিজা আবহাওয়ায় গোলাপ গাছকে প্রভাবিত করতে পারে। এটি ফুল, কুঁড়ি, গাছের ডালপালা, এবং পাতা ক্ষতিগ্রস্ত করতে পারে। এখানে আপনার গোলাপে বট্রাইটিস ব্লাইট প্রতিরোধ এবং পরিচালনার জন্য একটি বিস্তারিত তালিকা দেওয়া হলো:
          {'\n\n'}
          <Text style={styles.sectionTitle}>পরিচিতি:</Text>
          {'\n'}
          ফুল, কুঁড়ি, ডালপালা, এবং পাতায় ধূসর বা বাদামী মোল্ড দেখতে হবে।
          {'\n'}
          সংক্রমিত ফুলগুলি সঠিকভাবে খোলার ব্যর্থতা, wilt হতে পারে, অথবা পাপড়িতে বাদামী বিবর্ণতা দেখা দিতে পারে।
          {'\n'}
          বট্রাইটিস ব্লাইট ঠাণ্ডা, ভিজা অবস্থায় এবং উচ্চ আর্দ্রতা সহ উন্নত হয়।
          {'\n\n'}
          <Text style={styles.sectionTitle}>প্রতিরোধ:</Text>
          {'\n'}
          অনুকূল অবস্থার জন্য: আপনার গোলাপ গাছগুলির চারপাশে ভাল বাতাস চলাচলের লক্ষ্যে থাকুন। ঘন ঘন শাখাগুলি কেটে বাতাস প্রবাহ উন্নত করুন।
          {'\n'}
          জল দেওয়া: গভীরভাবে এবং কম পরিমাণে জল দিন, গাছের গোড়ায় জল দেওয়ার চেষ্টা করুন মাথার উপর জল দেওয়ার পরিবর্তে। ভেজা পাতা ছত্রাক বৃদ্ধির জন্য অনুকূল পরিবেশ তৈরি করে।
          {'\n'}
          ডেডহেডিং: নিয়মিতভাবে পুরানো ফুলগুলি কেটে ফেলে দিন যাতে সম্ভাব্য সংক্রমণের স্থানগুলি অপসারণ করা যায়।
          {'\n'}
          সাংস্কৃতিক অভ্যাস: বৃদ্ধি মৌসুম জুড়ে গোলাপ গাছের গোড়ায় পড়ে যাওয়া পাতা এবং আবর্জনা সরান। এটি আর্দ্রতা কমাতে সাহায্য করে এবং ছত্রাক বৃদ্ধির প্রতিরোধ করে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>পরিচালনা:</Text>
          {'\n'}
          প্রাথমিক শনাক্তকরণ: প্রাথমিক হস্তক্ষেপ অত্যন্ত গুরুত্বপূর্ণ। আপনি যদি বট্রাইটিস ব্লাইটের লক্ষণ দেখতে পান তবে সংক্রমিত গাছের অংশগুলিকে বিচ্ছিন্ন করুন যাতে রোগ ছড়িয়ে না পড়ে।
          {'\n'}
          অপসারণ: সংক্রমিত ফুল, কুঁড়ি, ডালপালা, এবং পাতাগুলি কেটে এবং সরিয়ে ফেলুন। অপসারিত গাছের অংশগুলি উচ্চ তাপমাত্রায় (140°F এর বেশি) কম্পোস্ট করে অথবা গৃহস্থালির আবর্জনার সাথে ব্যাগ করে ধ্বংস করুন।
          {'\n'}
          ছত্রাকনাশক (সীমিত কার্যকারিতা): একবার স্থাপিত হলে বট্রাইটিস ব্লাইটের জন্য কোন নিশ্চিত নিরাময় নেই। তবে, বট্রাইটিস ব্লাইটের জন্য নির্দিষ্ট লেবেলযুক্ত একটি ছত্রাকনাশক প্রয়োগ করতে পারেন, বিশেষত সেই সময়ে যখন রোগের জন্য অনুকূল অবস্থার সৃষ্টি হয়। লক্ষ্য করুন: ছত্রাকনাশকগুলি প্রাথমিকভাবে প্রতিরোধমূলক ব্যবহারের জন্য সবচেয়ে কার্যকর।
          {'\n\n'}
          <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
          {'\n'}
          মাথার উপর জল দেওয়া এড়িয়ে চলুন, কারণ এটি স্পোর ছড়িয়ে দিতে পারে।
          {'\n'}
          আপনার গোলাপগুলিকে নিয়মিতভাবে কেটে বাতাস চলাচল উন্নত করুন এবং ছত্রাকের জন্য সম্ভাব্য আশ্রয় স্থানগুলি অপসারণ করুন।
          {'\n'}
          আপনার গোলাপ গাছগুলিকে অতিরিক্ত জল দেওয়া বা অতিরিক্ত সার দেওয়ার মাধ্যমে স্ট্রেস করবেন না, কারণ স্ট্রেসযুক্ত গাছগুলি রোগের প্রতি আরও সংবেদনশীল।
          {'\n'}
          এই অভ্যাসগুলি অনুসরণ করে, আপনি বট্রাইটিস ব্লাইটের জন্য একটি কম অনুকূল পরিবেশ তৈরি করতে পারবেন এবং আপনার গোলাপ গাছগুলোকে স্বাস্থ্যবান রাখতে পারবেন। মনে রাখবেন, সঠিক যত্ন এবং স্বাস্থ্যবিধির মাধ্যমে প্রতিরোধই এই রোগ পরিচালনার সেরা পদ্ধতি।
        </Text>

        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/cc.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Cercospora Leaf Spot কালো ছোট দাগ</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}>
          সেরকোস্পোরা পাতার দাগ, যা সেরকোস্পোরা গণের ছত্রাকজনিত জীবাণুর কারণে হয়, একটি সাধারণ রোগ যা গোলাপকে প্রভাবিত করে। যদিও এটি ব্ল্যাক স্পটের মতো ধ্বংসাত্মক নয়, তবে এটি আপনার গোলাপ গাছের চেহারা এবং স্বাস্থ্যকে উল্লেখযোগ্যভাবে প্রভাবিত করতে পারে যদি এটি unchecked থাকে। আপনার জানা থাকা প্রয়োজন এমন কিছু বিষয় এখানে দেওয়া হলো:
          {'\n\n'}
          <Text style={styles.sectionTitle}>লক্ষণ এবং উপসর্গ:</Text>
          {'\n'}
          পাতার উপরের পৃষ্ঠায় ছোট, গোলাকার দাগ খুঁজুন। এই দাগগুলি সাধারণত বাদামী বা বেগুনি হয়, এবং পরিণত হলে কেন্দ্রে হালকা বাদামী বা ধূসর হয়।
          {'\n'}
          দাগগুলি কিছুটা হলুদ আভা দিয়ে ঘেরা থাকতে পারে।
          {'\n'}
          গুরুতর ক্ষেত্রে, দাগগুলি বড় হতে পারে এবং একত্রিত হয়ে পাতার উল্লেখযোগ্য ক্ষতি করতে পারে।
          {'\n'}
          সংক্রমিত পাতাগুলি হলুদ হতে পারে এবং আগেভাগে পড়তে পারে, যা গোলাপ গাছকে দুর্বল করে তোলে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>কারণ:</Text>
          {'\n'}
          সেরকোস্পোরা রোসিকোলা এবং সেরকোস্পোরা পুডেরি হল গোলাপে সেরকোস্পোরা পাতার দাগের প্রধান কারণ।
          {'\n'}
          এই ছত্রাকগুলি উষ্ণ, আর্দ্র অবস্থায় এবং প্রায়ই পাতার ভিজে থাকা অবস্থায় প্রসারিত হয়।
          {'\n'}
          মাথার উপর জল দেওয়া, দীর্ঘ সময়ের বৃষ্টি, এবং ঘন রোপণ যা বাতাস চলাচল সীমিত করে তা সেরকোস্পোরা পাতার দাগের উন্নয়নে সাহায্য করতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>পরিচালনা:</Text>
          {'\n'}
          প্রতিরোধ হল মূল: সেরকোস্পোরা পাতার দাগ প্রতিরোধের জন্য সেরা উপায় হল এটি ঘটনার আগে প্রতিরোধ করা। কিছু পদক্ষেপ নিচে দেওয়া হলো:
          {'\n'}
          জল দেওয়ার অভ্যাস: গভীরভাবে এবং কম পরিমাণে জল দিন, গাছের গোড়ায় জল দেওয়ার চেষ্টা করুন এবং পাতাগুলি ভিজানোর চেষ্টা এড়িয়ে চলুন।
          {'\n'}
          বাতাস চলাচল: আপনার গোলাপগুলি নিয়মিতভাবে কেটে বাতাস চলাচল উন্নত করুন। গোলাপ গাছগুলির ঘনত্ব এড়িয়ে চলুন।
          {'\n'}
          সাংস্কৃতিক অভ্যাস: বৃদ্ধি মৌসুমে গোলাপ গাছের গোড়ায় পড়ে যাওয়া পাতা এবং আবর্জনা নিয়মিতভাবে সরান। এটি আর্দ্রতা কমাতে সাহায্য করে এবং ছত্রাক বৃদ্ধির প্রতিরোধ করে।
          {'\n'}
          প্রতিরোধী জাত: সেরকোস্পোরা পাতার দাগের প্রতি প্রতিরোধী গোলাপ জাত রোপণের কথা বিবেচনা করুন।
          {'\n'}
          প্রতিষ্ঠিত সংক্রমণের জন্য চিকিৎসা:
          {'\n'}
          প্রাথমিক শনাক্তকরণ: প্রাথমিক হস্তক্ষেপ অত্যন্ত গুরুত্বপূর্ণ। আপনি যদি সেরকোস্পোরা পাতার দাগের লক্ষণ দেখতে পান তবে সংক্রমিত পাতাগুলি অপসারণ করুন এবং ধ্বংস করুন যাতে স্পোরগুলির বিস্তার বন্ধ হয়।
          {'\n'}
          ছত্রাকনাশক: যদি সংক্রমণ ব্যাপক হয়, তবে সেরকোস্পোরা পাতার দাগের জন্য বিশেষভাবে লেবেলযুক্ত একটি ছত্রাকনাশক প্রয়োগ করতে পারেন। পণ্য লেবেল নির্দেশনা অনুযায়ী প্রয়োগ করুন। লক্ষ্য করুন: ছত্রাকনাশকগুলি প্রাথমিকভাবে প্রতিরোধমূলক ব্যবহারের জন্য সবচেয়ে কার্যকর, তবে এটি প্রতিষ্ঠিত ক্ষেত্রে রোগের বিস্তার কমাতে সাহায্য করতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
          {'\n'}
          সঠিক সারাই এবং মালচিংয়ের মতো ভাল গোলাপ যত্নের অভ্যাস বজায় রাখুন যাতে স্বাস্থ্যবান এবং শক্তিশালী গাছ বৃদ্ধি পায়।
          {'\n'}
          মাথার উপর জল দেওয়া এড়িয়ে চলুন, কারণ এটি ছত্রাকের স্পোরগুলি স্বাস্থ্যবান পাতায় ছড়িয়ে দিতে পারে।
          {'\n'}
          সেরকোস্পোরা পাতার দাগের বিরুদ্ধে কার্যকারিতা প্রতিষ্ঠিত নয় এমন কিছু বাড়িতে তৈরি প্রতিকার যেমন বেকিং সোডা বা দুধ স্প্রে ব্যবহার করার অপশনও রয়েছে।
          {'\n'}
          এই অভ্যাসগুলি অনুসরণ করে, আপনি সেরকোস্পোরা পাতার দাগের ঝুঁকি উল্লেখযোগ্যভাবে কমাতে পারবেন এবং আপনার গোলাপগুলোকে সুন্দর রাখতে পারবেন। মনে রাখবেন, সঠিক যত্ন এবং স্বাস্থ্যবিধি মেনে চলার মাধ্যমে প্রতিরোধই এই ছত্রাকজনিত রোগের বিরুদ্ধে সেরা প্রতিরক্ষা।
        </Text>
        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/d.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>Downy Mildew হলুদ দাগ</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}> ডাউনি মিলডিউ হল একটি ধ্বংসাত্মক ছত্রাকজনিত রোগ যা বিভিন্ন ধরনের উদ্ভিদকে প্রভাবিত করতে পারে, এর মধ্যে গোলাপও রয়েছে। এটি গাছকে দুর্বল করে এবং এর সামগ্রিক স্বাস্থ্য এবং সৌন্দর্য কমিয়ে দেয়। গোলাপে ডাউনি মিলডিউ সম্পর্কিত বিস্তারিত বিষয়াবলী এখানে দেওয়া হলো, যার মধ্যে শনাক্তকরণ, প্রতিরোধ এবং নিয়ন্ত্রণের উপায়গুলি অন্তর্ভুক্ত রয়েছে:
          {'\n\n'}
          <Text style={styles.sectionTitle}>সনাক্তকরণ:</Text>
          {'\n'}
          পাতায় নিম্নলিখিত লক্ষণগুলো খুঁজুন:
          {'\n'}
          {'\u2022'} পাতার উপরের দিকে অসমান আকারের, বেগুনি-লাল, বাদামী, বা কালো দাগ। এই দাগগুলো সাধারণত পাতার শিরা দ্বারা সীমিত থাকে, ফলে কোণাকারে দেখা যায়।
          {'\n'}
          {'\u2022'} পাতার নীচে আপনি একটি সাদা বা ধূসর, তুলতুলে ছত্রাকের বৃদ্ধি দেখতে পাবেন, বিশেষত আর্দ্র অবস্থায়।
          {'\n'}
          ডাউনি মিলডিউ ঠাণ্ডা, ভেজা আবহাওয়ায় এবং উচ্চ আর্দ্রতায় বৃদ্ধি পায়।
          {'\n'}
          সংক্রমিত পাতাগুলি বিকৃত হতে পারে এবং হলুদ হয়ে গিয়ে আগেভাগে পড়ে যেতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>কারণ:</Text>
          {'\n'}
          অধিকাংশ গোলাপের রোগের মতো ছত্রাকজনিত নয়, ডাউনি মিলডিউ একটি প্রকৃত ছত্রাক নয় বরং একটি উমাইসেট, যা পানির মতো একপ্রকার জীবাণু।
          {'\n'}
          গোলাপের জন্য নির্দিষ্ট রোগজীবাণু হল পেরোনোপসোরা স্পারসা।
          {'\n\n'}
          <Text style={styles.sectionTitle}>প্রতিরোধ:</Text>
          {'\n'}
          অনুকূল পরিবেশ: ডাউনি মিলডিউ গরম এবং শুষ্ক পরিবেশে কম প্রসারিত হয়। আপনার গোলাপের জন্য প্রতিদিন অন্তত ৬ ঘণ্টা রোদ দেওয়া এবং গাছগুলির চারপাশে বাতাস চলাচল উন্নত করা নিশ্চিত করুন যাতে আর্দ্রতা সঞ্চিত না হয়।
          {'\n'}
          রোপণ: একটি ভালো বাতাস চলাচলযুক্ত স্থান নির্বাচন করুন এবং জলসঞ্চয়ের প্রবণ এমন নিম্ন অঞ্চলে গোলাপ রোপণ এড়িয়ে চলুন।
          {'\n'}
          জল দেওয়া: গভীরভাবে এবং কম পরিমাণে জল দিন, জলকে গাছের গোড়ায় পৌঁছানোর চেষ্টা করুন এবং পাতাগুলি ভিজানোর চেষ্টা এড়িয়ে চলুন। ভিজে থাকা পাতাগুলি ছত্রাক বৃদ্ধির জন্য অনুকূল পরিবেশ সৃষ্টি করে।
          {'\n'}
          প্রতিরোধী জাত: ডাউনি মিলডিউ প্রতিরোধী গোলাপ জাত নির্বাচন করুন।
          {'\n'}
          সাংস্কৃতিক অভ্যাস: বৃদ্ধি মৌসুমে গোলাপ গাছের গোড়ায় পড়ে যাওয়া পাতা এবং আবর্জনা নিয়মিতভাবে সরান। এই উপকরণগুলিতে ছত্রাকের স্পোরগুলির শীতকালীন অবস্থায় থাকতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>নিয়ন্ত্রণের পদ্ধতি:</Text>
          {'\n'}
          প্রাথমিক শনাক্তকরণ: প্রাথমিক হস্তক্ষেপ অত্যন্ত গুরুত্বপূর্ণ। আপনি যদি ডাউনি মিলডিউ-এর লক্ষণ দেখতে পান তবে সংক্রমিত গোলাপ গাছটিকে পৃথক করে দিন যাতে রোগটি ছড়িয়ে না পড়ে।
          {'\n'}
          অপসারণ: প্রবলভাবে সংক্রমিত পাতাগুলি অপসারণ করুন এবং ধ্বংস করুন যাতে ছত্রাকের স্পোরগুলি সরানো যায়।
          {'\n'}
          ছত্রাকনাশক: গোলাপে ডাউনি মিলডিউ চিকিৎসার জন্য বিশেষভাবে লেবেলযুক্ত একটি ছত্রাকনাশক প্রয়োগ করুন, বিশেষত সাধারণ বসন্ত এবং পতনের প্রাদুর্ভাবের আগে বা রোগের জন্য অনুকূল অবস্থায়। তামার অক্সিক্লোরাইড, ক্লোরোথালোনিল, বা পটাশিয়াম বিকরবোনেট ধারণকারী ছত্রাকনাশক খুঁজুন।
          {'\n'}
          জৈব বিকল্প (মৃদু ক্ষেত্রে): মৃদু ক্ষেত্রে, আক্রান্ত এলাকায় একটি শক্ত জলরাশি স্প্রে করার চেষ্টা করতে পারেন স্পোরগুলি সরানোর জন্য। আপনি জৈব ছত্রাকনাশক যেমন নীম তেল সমাধান বা পটাশিয়াম বিকরবোনেট সমাধানও চেষ্টা করতে পারেন। তবে, এগুলি বাণিজ্যিক ছত্রাকনাশকের মতো কার্যকর নাও হতে পারে।
          {'\n\n'}
          <Text style={styles.sectionTitle}>অতিরিক্ত টিপস:</Text>
          {'\n'}
          আপনার গোলাপগুলিকে অতিরিক্ত সার প্রয়োগ করা এড়ান, বিশেষ করে নাইট্রোজেন সমৃদ্ধ সার ব্যবহার করে, কারণ এটি নতুন বৃদ্ধিকে উত্সাহিত করতে পারে যা ডাউনি মিলডিউ-এর প্রতি সংবেদনশীল।
          {'\n'}
          আপনার গোলাপগুলি নিয়মিতভাবে কেটে বাতাস চলাচল উন্নত করুন এবং ছত্রাকের আশ্রয়স্থলগুলি অপসারণ করুন।
          {'\n'}
          এই অভ্যাসগুলি অনুসরণ করে, আপনি ডাউনি মিলডিউ-এর প্রাদুর্ভাবের ঝুঁকি উল্লেখযোগ্যভাবে কমাতে পারবেন এবং আপনার গোলাপগুলোকে স্বাস্থ্যবান ও সুন্দর রাখতে পারবেন। মনে রাখবেন, সঠিক যত্ন এবং স্বাস্থ্যবিধির মাধ্যমে প্রতিরোধই এই উমাইসেট রোগের বিরুদ্ধে সেরা প্রতিরক্ষা।
        </Text>

        </View>
      </Collapsible>
        
        <View style={styles.imageContainer}>
          <Image
            source={require('./img/rc.jpg')}
            style={styles.image}
          />
        </View>
        
        <Text style={styles.infoText}>গোলাপ রোপণ</Text>
        <Collapsible title="আরো বিস্তারিত জানুন" 
  expandedTitle="বন্ধ করুন" 
  collapsedTitle="আরো বিস্তারিত জানুন" >
        <View style={{ padding: 1 }}>
        <Text style={{color:'black',fontWeight:'bold'}}> 
      "গোলাপ জন্মানোর জন্য জলবায়ু এবং মাটির অবস্থার উপযুক্ততা মূল্যায়ন করা সফল চাষের জন্য অত্যন্ত গুরুত্বপূর্ণ। সর্বোত্তম স্থান নির্বাচনের মধ্যে রয়েছে যথেষ্ট সূর্যালোক এক্সপোজার সহ ভাল-নিষ্কাশিত মাটি নির্বাচন করা, আদর্শভাবে প্রতিদিন 6-8 ঘন্টা, পাশাপাশি প্রবল বাতাস থেকে সুরক্ষা বিবেচনা করা এবং অ্যাক্সেসযোগ্যতা নিশ্চিত করা। সেচ এবং রক্ষণাবেক্ষণের জন্য মাটির পিএইচ মাত্রা এবং উর্বরতা পরীক্ষা করা হয়, যার লক্ষ্য জৈব পদার্থ দিয়ে সমৃদ্ধ করা এবং গঠন ও উর্বরতা বৃদ্ধি করা, গোলাপের জাত নির্বাচন করার সময়, কারণগুলি। মাটির ধরন, এবং উদ্দেশ্যপ্রণোদিত ব্যবহারের জন্য পছন্দগুলিকে নির্দেশিত করা উচিত, যেখানে প্রত্যয়িত রোগ-মুক্ত গাছগুলিকে সম্মানিত উত্স থেকে দেওয়া হয়, রোপণ কৌশলগুলির মধ্যে রয়েছে সঠিক সময়, কম্পোস্ট দিয়ে সংশোধিত পর্যাপ্ত আকারের গর্ত খনন করা এবং ব্যাকফিলিং করার আগে গ্রাফ্ট ইউনিয়নের সাথে গাছের অবস্থান। এবং পুঙ্খানুপুঙ্খভাবে জল দেওয়া কার্যকরী সেচ কৌশলগুলির মধ্যে রয়েছে সামঞ্জস্যপূর্ণ আর্দ্রতার ব্যবস্থা, আদর্শভাবে ড্রিপ সিস্টেম বা সোকার পায়ের পাতার মোজাবিশেষের মাধ্যমে, আর্দ্রতা ধরে রাখার জন্য এবং আগাছা দমনের জন্য মালচিং দ্বারা পরিপূরক। নির্দেশ অনুযায়ী সুষম ফর্মুলেশনের মাধ্যমে নিষিক্তকরণ, বসন্তের শুরুতে এবং পরে আবার ঘটতে হবে, অতিরিক্ত নাইট্রোজেন প্রয়োগের বিরুদ্ধে সতর্কতার সাথে। সুপ্ত ঋতুতে ছাঁটাই গাছের স্বাস্থ্য এবং আকৃতি বজায় রাখতে সাহায্য করে, বিভিন্ন ধরনের গোলাপের জন্য বিভিন্ন মাত্রার মনোযোগ প্রয়োজন। সতর্ক কীটপতঙ্গ এবং রোগ পর্যবেক্ষণ, স্যানিটেশন এবং রোগ-প্রতিরোধী জাত নির্বাচনের মতো সক্রিয় পদক্ষেপ দ্বারা পরিপূরক, অত্যন্ত গুরুত্বপূর্ণ। সর্বোত্তম কুঁড়ি পর্যায়ে গোলাপ সংগ্রহ করা, পরিষ্কার, ধারালো সরঞ্জাম ব্যবহার করে এবং নিমজ্জিত পাতা অপসারণ, গুণমানের ফুল নিশ্চিত করে। ফসল কাটার পরের যত্নে তাৎক্ষণিক হাইড্রেশন, ব্যাকটেরিয়ার বৃদ্ধি রোধ করতে পাতা অপসারণ এবং শীতল, খসড়া-মুক্ত স্থানে সংরক্ষণ করা জড়িত। এই অভ্যাসগুলি মেনে চলার মাধ্যমে, গোলাপ উত্সাহীরা সমৃদ্ধ গাছপালা চাষ করতে পারে এবং প্রচুর ফসল উপভোগ করতে পারে৷
         
         </Text>

        </View>
      </Collapsible>

        <TouchableOpacity onPress={handlePress} style={styles.button}>
          <Text style={styles.linkText}>
            গোলাপের রোগ সম্পর্কে আরও জানুন
          </Text>
        </TouchableOpacity>

        <TouchableOpacity onPress={handlePress2} style={styles.button}>
          <Text style={styles.linkText}>
            গোলাপ রোপণ সম্পর্কে আরও জানুন
          </Text>
        </TouchableOpacity>
        
        <TouchableOpacity onPress={handlePress3} style={styles.button}>
          <Text style={styles.linkText}>
            বাড়িতে গোলাপ রোপণ সম্পর্কে জানুন
          </Text>
        </TouchableOpacity>
      </View>
    </ScrollView>
  );

}
const styles = StyleSheet.create({
  scrollContainer: {
    flexGrow: 1,
    justifyContent: 'center',
    alignItems: 'center',
    backgroundColor: '#90EE90',
  },
  container: {
    flex: 1, // Full width of the screen
    alignItems:'center'// Added padding for better content spacing
  },
  image: {
    width: 100,
    height: 100,
  },
  button: {
    backgroundColor: '#007BFF', // Background color for button
    paddingVertical: 12,
    paddingHorizontal: 24,
    borderRadius: 8,
    marginBottom: 10, // Margin between buttons
    alignItems: 'center',
    justifyContent: 'center',
  },
  linkText: {
    color: '#FFF',
    fontSize: 16,
    fontWeight: 'bold',
    textAlign: 'center', // Center text alignment
  },
  text: {
    color: 'red',
    fontSize: 20,
    textAlign: 'center', // Center text alignment
  },
  infoText: {
    marginVertical: 10, // Added margin for spacing around the text
    textAlign: 'center',
    backgroundColor: 'pink', // Applying background color here
    padding: 5, // Optional padding for better appearance
  },
  imageContainer: {
    alignItems: 'center',
    marginTop: 20, // Added margin for spacing above the image and links
  },
  sectionTitle: {
    fontWeight: 'bold',
    color: 'brown',
  },
  content: {
    padding: 10,
    backgroundColor: '#f0f0f0',
  },
});
export default Profile